---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewDWFExportOptions
source: html/ab600b3f-e24b-bf02-7c22-cd9aa51e31cf.htm
---
# Autodesk.Revit.Creation.Application.NewDWFExportOptions Method

Creates DWF Export options.

## Syntax (C#)
```csharp
public DWFExportOptions NewDWFExportOptions()
```